/*
*****************************************************************************
    功能：外设初始化
    时间：2022.02.15
    人员：wjonas
    修改记录：
        wjonas 2022.02.15  修改
*****************************************************************************
*/ 

#include "config.h"
#include "system.h"

/************************************************************
功能：外设初始化
时间：2022.02.15
人员：wjonas
调用位置：rt_hw_board_init()  系统启动处调用
入参：无
出参：无
************************************************************/
void SysInit(void)
{
    //系统滴答定时器初始化
	SysTickInit();
    
    //LED初始化
	LedGpioInit();
    
    //BEEP初始化
    BeepGpioInit();
    
    //串口初始化
	UsartInit();
    
    //外部中断初始化
	ExtiInit();
#if	USING_BUTTON    
    //中断周期为1ms,用于按键扫描	
	Timer_Configuration();
#endif
}




